Cloud-Lightning/Clight/bsp/port/stm32/bsp_adc16_stm32.cpp
#include "bsp_adc16.h"

#include <cstdint>
#include <cstring>

extern "C" {
#include "main.h"
}

#if defined(HAL_ADC_MODULE_ENABLED)

namespace {

constexpr std::uint8_t kMaxSequenceChannels = 16U;
constexpr std::uint8_t kMaxInjectedChannels = 4U;

typedef struct {
    ADC_TypeDef *base;
    IRQn_Type irq;
    uint8_t default_channel;
    bool has_pinmux;
    uint32_t features;
    ADC_HandleTypeDef handle;
    bsp_adc16_init_config_t config;
    bool initialized;
    uint8_t active_channel;
    bool sequence_active;
    bool sequence_continuous;
    bool sequence_hardware_trigger;
    bool has_sequence_trigger_route;
    uint32_t sequence_external_trigger;
    uint32_t sequence_external_trigger_edge;
    uint8_t sequence_count;
    uint8_t sequence_index;
    uint8_t sequence_channels[kMaxSequenceChannels];
    bsp_adc16_sample_t sequence_samples[kMaxSequenceChannels];
    bool sequence_dma_active;
    bool sequence_dma_circular;
    uint32_t *sequence_dma_buffer;
    uint32_t sequence_dma_sample_count;
    bool preemption_active;
    bool preemption_hardware_trigger;
    bool has_preemption_trigger_route;
    uint32_t preemption_external_trigger;
    uint32_t preemption_external_trigger_edge;
    uint8_t preemption_trigger_channel;
    uint8_t preemption_count;
    uint8_t preemption_channels[kMaxInjectedChannels];
    bsp_adc16_sample_t preemption_samples[kMaxInjectedChannels];
    bsp_adc16_callback_t callback;
    void *callback_arg;
    bsp_adc16_sequence_callback_t sequence_callback;
    void *sequence_callback_arg;
    bsp_adc16_preemption_callback_t preemption_callback;
    void *preemption_callback_arg;
} adc16_map_t;

#define BSP_ADC16_MAP_ITEM(name, base, irq, clk, ch, clk_src_bus, has_pinmux, features) \
    { base, irq, static_cast<uint8_t>(ch), (has_pinmux) != 0U, static_cast<uint32_t>(features), {}, {}, false, static_cast<uint8_t>(ch), false, false, false, false, ADC_SOFTWARE_START, ADC_EXTERNALTRIGCONVEDGE_NONE, 0U, 0U, {}, {}, false, false, nullptr, 0U, false, false, false, ADC_INJECTED_SOFTWARE_START, ADC_EXTERNALTRIGINJECCONV_EDGE_NONE, 0U, 0U, {}, {}, nullptr, nullptr, nullptr, nullptr, nullptr, nullptr },
static adc16_map_t s_adc16_map[BSP_ADC16_MAX] = {
    BSP_ADC16_LIST(BSP_ADC16_MAP_ITEM)
};
#undef BSP_ADC16_MAP_ITEM

static DMA_HandleTypeDef s_adc1_dma;
static bool s_adc1_dma_configured = false;

bool adc16_has_feature(const adc16_map_t &map, uint32_t feature)
{
    return (map.features & feature) != 0U;
}

uint32_t resolution_to_hal(bsp_adc16_resolution_t resolution)
{
    switch (resolution) {
    case BSP_ADC16_RESOLUTION_8_BITS: return ADC_RESOLUTION_8B;
    case BSP_ADC16_RESOLUTION_10_BITS: return ADC_RESOLUTION_10B;
    case BSP_ADC16_RESOLUTION_12_BITS: return ADC_RESOLUTION_12B;
    case BSP_ADC16_RESOLUTION_16_BITS:
    case BSP_ADC16_RESOLUTION_DEFAULT:
    default:
        return ADC_RESOLUTION_16B;
    }
}

uint32_t divider_to_hal(bsp_adc16_clock_divider_t divider)
{
    switch (divider) {
    case BSP_ADC16_CLOCK_DIVIDER_1: return ADC_CLOCK_ASYNC_DIV1;
    case BSP_ADC16_CLOCK_DIVIDER_2: return ADC_CLOCK_ASYNC_DIV2;
    case BSP_ADC16_CLOCK_DIVIDER_4: return ADC_CLOCK_ASYNC_DIV4;
    case BSP_ADC16_CLOCK_DIVIDER_6: return ADC_CLOCK_ASYNC_DIV6;
    case BSP_ADC16_CLOCK_DIVIDER_8: return ADC_CLOCK_ASYNC_DIV8;
    case BSP_ADC16_CLOCK_DIVIDER_10: return ADC_CLOCK_ASYNC_DIV10;
    case BSP_ADC16_CLOCK_DIVIDER_12: return ADC_CLOCK_ASYNC_DIV12;
    case BSP_ADC16_CLOCK_DIVIDER_16: return ADC_CLOCK_ASYNC_DIV16;
    case BSP_ADC16_CLOCK_DIVIDER_DEFAULT:
    default:
        return ADC_CLOCK_ASYNC_DIV4;
    }
}

bool is_supported_config(const bsp_adc16_init_config_t &config)
{
    switch (config.resolution) {
    case BSP_ADC16_RESOLUTION_DEFAULT:
    case BSP_ADC16_RESOLUTION_8_BITS:
    case BSP_ADC16_RESOLUTION_10_BITS:
    case BSP_ADC16_RESOLUTION_12_BITS:
    case BSP_ADC16_RESOLUTION_16_BITS:
        break;
    default:
        return false;
    }

    switch (config.clock_divider) {
    case BSP_ADC16_CLOCK_DIVIDER_DEFAULT:
    case BSP_ADC16_CLOCK_DIVIDER_1:
    case BSP_ADC16_CLOCK_DIVIDER_2:
    case BSP_ADC16_CLOCK_DIVIDER_4:
    case BSP_ADC16_CLOCK_DIVIDER_6:
    case BSP_ADC16_CLOCK_DIVIDER_8:
    case BSP_ADC16_CLOCK_DIVIDER_10:
    case BSP_ADC16_CLOCK_DIVIDER_12:
    case BSP_ADC16_CLOCK_DIVIDER_16:
        return true;
    default:
        return false;
    }
}

int32_t validate_adc16_config_features(const adc16_map_t &map, const bsp_adc16_init_config_t &config)
{
    if (!is_supported_config(config)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if ((config.resolution != BSP_ADC16_RESOLUTION_DEFAULT) &&
        !adc16_has_feature(map, BSP_ADC16_FEATURE_CONFIGURABLE_RESOLUTION)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if ((config.clock_divider != BSP_ADC16_CLOCK_DIVIDER_DEFAULT) &&
        !adc16_has_feature(map, BSP_ADC16_FEATURE_CONFIGURABLE_CLOCK_DIVIDER)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    return BSP_OK;
}

bool is_supported_external_trigger(uint32_t trigger)
{
    switch (trigger) {
    case ADC_SOFTWARE_START:
    case ADC_EXTERNALTRIG_T1_TRGO:
    case ADC_EXTERNALTRIG_T1_TRGO2:
    case ADC_EXTERNALTRIG_T2_TRGO:
    case ADC_EXTERNALTRIG_T3_TRGO:
    case ADC_EXTERNALTRIG_T4_TRGO:
    case ADC_EXTERNALTRIG_T6_TRGO:
    case ADC_EXTERNALTRIG_T8_TRGO:
    case ADC_EXTERNALTRIG_T8_TRGO2:
    case ADC_EXTERNALTRIG_T15_TRGO:
#ifdef ADC_EXTERNALTRIG_T23_TRGO
    case ADC_EXTERNALTRIG_T23_TRGO:
#endif
#ifdef ADC_EXTERNALTRIG_T24_TRGO
    case ADC_EXTERNALTRIG_T24_TRGO:
#endif
        return true;
    default:
        return false;
    }
}

bool is_supported_injected_external_trigger(uint32_t trigger)
{
    switch (trigger) {
    case ADC_INJECTED_SOFTWARE_START:
#ifdef ADC_EXTERNALTRIGINJEC_T1_TRGO
    case ADC_EXTERNALTRIGINJEC_T1_TRGO:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T1_TRGO2
    case ADC_EXTERNALTRIGINJEC_T1_TRGO2:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T1_CC4
    case ADC_EXTERNALTRIGINJEC_T1_CC4:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T2_TRGO
    case ADC_EXTERNALTRIGINJEC_T2_TRGO:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T2_CC1
    case ADC_EXTERNALTRIGINJEC_T2_CC1:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T3_TRGO
    case ADC_EXTERNALTRIGINJEC_T3_TRGO:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T3_CC1
    case ADC_EXTERNALTRIGINJEC_T3_CC1:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T3_CC3
    case ADC_EXTERNALTRIGINJEC_T3_CC3:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T3_CC4
    case ADC_EXTERNALTRIGINJEC_T3_CC4:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T4_TRGO
    case ADC_EXTERNALTRIGINJEC_T4_TRGO:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T6_TRGO
    case ADC_EXTERNALTRIGINJEC_T6_TRGO:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T8_TRGO
    case ADC_EXTERNALTRIGINJEC_T8_TRGO:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T8_TRGO2
    case ADC_EXTERNALTRIGINJEC_T8_TRGO2:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T8_CC4
    case ADC_EXTERNALTRIGINJEC_T8_CC4:
#endif
#ifdef ADC_EXTERNALTRIGINJEC_T15_TRGO
    case ADC_EXTERNALTRIGINJEC_T15_TRGO:
#endif
        return true;
    default:
        return false;
    }
}

uint32_t trigger_route_edge(const bsp_adc16_trigger_route_t &route)
{
    switch (route.output) {
    case ADC_EXTERNALTRIGCONVEDGE_RISING:
    case ADC_EXTERNALTRIGCONVEDGE_FALLING:
    case ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING:
        return route.output;
    default:
        break;
    }

