Cloud-Lightning/Clight/bsp/port/stm32/bsp_adc16_stm32.cpp
    if (route.type == BSP_ADC16_TRIGGER_OUTPUT_PULSE_BOTH) {
        return ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING;
    }
    if (route.type == BSP_ADC16_TRIGGER_OUTPUT_PULSE_FALLING) {
        return (route.invert == BSP_ENABLE) ? ADC_EXTERNALTRIGCONVEDGE_RISING : ADC_EXTERNALTRIGCONVEDGE_FALLING;
    }
    return (route.invert == BSP_ENABLE) ? ADC_EXTERNALTRIGCONVEDGE_FALLING : ADC_EXTERNALTRIGCONVEDGE_RISING;
}

uint32_t injected_trigger_route_edge(const bsp_adc16_trigger_route_t &route)
{
    switch (route.output) {
    case ADC_EXTERNALTRIGINJECCONV_EDGE_RISING:
    case ADC_EXTERNALTRIGINJECCONV_EDGE_FALLING:
    case ADC_EXTERNALTRIGINJECCONV_EDGE_RISINGFALLING:
        return route.output;
    default:
        break;
    }

    if (route.type == BSP_ADC16_TRIGGER_OUTPUT_PULSE_BOTH) {
        return ADC_EXTERNALTRIGINJECCONV_EDGE_RISINGFALLING;
    }
    if (route.type == BSP_ADC16_TRIGGER_OUTPUT_PULSE_FALLING) {
        return (route.invert == BSP_ENABLE) ? ADC_EXTERNALTRIGINJECCONV_EDGE_RISING : ADC_EXTERNALTRIGINJECCONV_EDGE_FALLING;
    }
    return (route.invert == BSP_ENABLE) ? ADC_EXTERNALTRIGINJECCONV_EDGE_FALLING : ADC_EXTERNALTRIGINJECCONV_EDGE_RISING;
}

uint32_t rank_to_hal(uint8_t index)
{
    switch (index) {
    case 0U: return ADC_REGULAR_RANK_1;
    case 1U: return ADC_REGULAR_RANK_2;
    case 2U: return ADC_REGULAR_RANK_3;
    case 3U: return ADC_REGULAR_RANK_4;
    case 4U: return ADC_REGULAR_RANK_5;
    case 5U: return ADC_REGULAR_RANK_6;
    case 6U: return ADC_REGULAR_RANK_7;
    case 7U: return ADC_REGULAR_RANK_8;
    case 8U: return ADC_REGULAR_RANK_9;
    case 9U: return ADC_REGULAR_RANK_10;
    case 10U: return ADC_REGULAR_RANK_11;
    case 11U: return ADC_REGULAR_RANK_12;
    case 12U: return ADC_REGULAR_RANK_13;
    case 13U: return ADC_REGULAR_RANK_14;
    case 14U: return ADC_REGULAR_RANK_15;
    default: return ADC_REGULAR_RANK_16;
    }
}

uint32_t injected_rank_to_hal(uint8_t index)
{
    switch (index) {
    case 0U: return ADC_INJECTED_RANK_1;
    case 1U: return ADC_INJECTED_RANK_2;
    case 2U: return ADC_INJECTED_RANK_3;
    default: return ADC_INJECTED_RANK_4;
    }
}

uint32_t channel_to_hal(uint8_t channel)
{
    switch (channel) {
    case 0U: return ADC_CHANNEL_0;
    case 1U: return ADC_CHANNEL_1;
    case 2U: return ADC_CHANNEL_2;
    case 3U: return ADC_CHANNEL_3;
    case 4U: return ADC_CHANNEL_4;
    case 5U: return ADC_CHANNEL_5;
    case 6U: return ADC_CHANNEL_6;
    case 7U: return ADC_CHANNEL_7;
    case 8U: return ADC_CHANNEL_8;
    case 9U: return ADC_CHANNEL_9;
    case 10U: return ADC_CHANNEL_10;
    case 11U: return ADC_CHANNEL_11;
    case 12U: return ADC_CHANNEL_12;
    case 13U: return ADC_CHANNEL_13;
    case 14U: return ADC_CHANNEL_14;
    case 15U: return ADC_CHANNEL_15;
    case 16U: return ADC_CHANNEL_16;
    case 17U: return ADC_CHANNEL_17;
    case 18U: return ADC_CHANNEL_18;
    case 19U: return ADC_CHANNEL_19;
    default: return 0U;
    }
}

void adc_gpio_init_for_default_channel(uint8_t channel)
{
    GPIO_InitTypeDef gpio = {};
    gpio.Mode = GPIO_MODE_ANALOG;
    gpio.Pull = GPIO_NOPULL;

    switch (channel) {
    case 0U:
        __HAL_RCC_GPIOA_CLK_ENABLE();
        gpio.Pin = GPIO_PIN_0;
        HAL_GPIO_Init(GPIOA, &gpio);
        break;
    case 1U:
        __HAL_RCC_GPIOA_CLK_ENABLE();
        gpio.Pin = GPIO_PIN_1;
        HAL_GPIO_Init(GPIOA, &gpio);
        break;
    default:
        break;
    }
}

bool configure_adc1_dma(adc16_map_t &map, bool circular)
{
    if (map.base != ADC1) {
        return false;
    }

    if (s_adc1_dma_configured && (s_adc1_dma.Init.Mode == (circular ? DMA_CIRCULAR : DMA_NORMAL))) {
        map.handle.DMA_Handle = &s_adc1_dma;
        return true;
    }

    if (s_adc1_dma_configured) {
        (void) HAL_DMA_DeInit(&s_adc1_dma);
        s_adc1_dma_configured = false;
    }

    std::memset(&s_adc1_dma, 0, sizeof(s_adc1_dma));
    s_adc1_dma.Instance = DMA1_Stream5;
    s_adc1_dma.Init.Request = DMA_REQUEST_ADC1;
    s_adc1_dma.Init.Direction = DMA_PERIPH_TO_MEMORY;
    s_adc1_dma.Init.PeriphInc = DMA_PINC_DISABLE;
    s_adc1_dma.Init.MemInc = DMA_MINC_ENABLE;
    s_adc1_dma.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    s_adc1_dma.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
    s_adc1_dma.Init.Mode = circular ? DMA_CIRCULAR : DMA_NORMAL;
    s_adc1_dma.Init.Priority = DMA_PRIORITY_HIGH;
    s_adc1_dma.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&s_adc1_dma) != HAL_OK) {
        return false;
    }

    map.handle.DMA_Handle = &s_adc1_dma;
    s_adc1_dma.Parent = &map.handle;
    HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);
    s_adc1_dma_configured = true;
    return true;
}

void emit_sequence_dma_samples(adc16_map_t &map, const uint32_t *buffer, uint32_t sample_count)
{
    if ((buffer == nullptr) || (map.sequence_callback == nullptr) || (map.sequence_count == 0U)) {
        return;
    }

    const uint32_t groups = sample_count / map.sequence_count;
    for (uint32_t group = 0U; group < groups; ++group) {
        for (uint8_t sample_index = 0U; sample_index < map.sequence_count; ++sample_index) {
            const uint32_t buffer_index = (group * map.sequence_count) + sample_index;
            map.sequence_samples[sample_index].channel = map.sequence_channels[sample_index];
            map.sequence_samples[sample_index].index = sample_index;
            map.sequence_samples[sample_index].trigger_channel = 0U;
            map.sequence_samples[sample_index].value = static_cast<uint16_t>(buffer[buffer_index] & 0xFFFFU);
        }
        map.sequence_callback(map.sequence_samples, map.sequence_count, map.sequence_callback_arg);
    }
}

int32_t configure_channel_rank(adc16_map_t &map, uint8_t channel, uint8_t rank_index)
{
    const auto hal_channel = channel_to_hal(channel);
    if ((hal_channel == 0U) && (channel != 0U)) {
        return BSP_ERROR_PARAM;
    }

    ADC_ChannelConfTypeDef channel_cfg = {};
    channel_cfg.Channel = hal_channel;
    channel_cfg.Rank = rank_to_hal(rank_index);
    channel_cfg.SamplingTime = ADC_SAMPLETIME_387CYCLES_5;
    channel_cfg.SingleDiff = ADC_SINGLE_ENDED;
    channel_cfg.OffsetNumber = ADC_OFFSET_NONE;
    channel_cfg.Offset = 0;
    channel_cfg.OffsetSignedSaturation = DISABLE;

