Cloud-Lightning/Clight/bsp/port/stm32/bsp_adc16_stm32.cpp
    return (HAL_ADC_ConfigChannel(&map.handle, &channel_cfg) == HAL_OK) ? BSP_OK : BSP_ERROR;
}

int32_t configure_injected_channel_rank(adc16_map_t &map,
                                        uint8_t channel,
                                        uint8_t rank_index,
                                        uint8_t count,
                                        bool hardware_trigger)
{
    const auto hal_channel = channel_to_hal(channel);
    if ((hal_channel == 0U) && (channel != 0U)) {
        return BSP_ERROR_PARAM;
    }

    ADC_InjectionConfTypeDef injected = {};
    injected.InjectedChannel = hal_channel;
    injected.InjectedRank = injected_rank_to_hal(rank_index);
    injected.InjectedSamplingTime = ADC_SAMPLETIME_387CYCLES_5;
    injected.InjectedSingleDiff = ADC_SINGLE_ENDED;
    injected.InjectedOffsetNumber = ADC_OFFSET_NONE;
    injected.InjectedOffset = 0U;
    injected.InjectedOffsetRightShift = DISABLE;
#if defined(ADC_VER_V5_V90)
    injected.InjectedOffsetSign = 0U;
    injected.InjectedOffsetSaturation = DISABLE;
#endif
    injected.InjectedOffsetSignedSaturation = DISABLE;
    injected.InjectedNbrOfConversion = count;
    injected.InjectedDiscontinuousConvMode = DISABLE;
    injected.AutoInjectedConv = DISABLE;
    injected.QueueInjectedContext = DISABLE;
    injected.ExternalTrigInjecConv = hardware_trigger ? map.preemption_external_trigger : ADC_INJECTED_SOFTWARE_START;
    injected.ExternalTrigInjecConvEdge = hardware_trigger ? map.preemption_external_trigger_edge : ADC_EXTERNALTRIGINJECCONV_EDGE_NONE;
    injected.InjecOversamplingMode = DISABLE;

    return (HAL_ADCEx_InjectedConfigChannel(&map.handle, &injected) == HAL_OK) ? BSP_OK : BSP_ERROR;
}

void fill_init(ADC_HandleTypeDef &handle,
               ADC_TypeDef *base,
               const bsp_adc16_init_config_t &config,
               uint8_t conversion_count,
               bool hardware_trigger,
               uint32_t external_trigger,
               uint32_t external_trigger_edge)
{
    handle.Instance = base;
    handle.Init.ClockPrescaler = divider_to_hal(config.clock_divider);
    handle.Init.Resolution = resolution_to_hal(config.resolution);
    handle.Init.ScanConvMode = (conversion_count > 1U) ? ADC_SCAN_ENABLE : ADC_SCAN_DISABLE;
    handle.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    handle.Init.LowPowerAutoWait = DISABLE;
    handle.Init.ContinuousConvMode = DISABLE;
    handle.Init.NbrOfConversion = conversion_count;
    handle.Init.DiscontinuousConvMode = DISABLE;
    handle.Init.ExternalTrigConv = hardware_trigger ? external_trigger : ADC_SOFTWARE_START;
    handle.Init.ExternalTrigConvEdge = hardware_trigger ? external_trigger_edge : ADC_EXTERNALTRIGCONVEDGE_NONE;
    handle.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DR;
    handle.Init.Overrun = ADC_OVR_DATA_PRESERVED;
    handle.Init.LeftBitShift = ADC_LEFTBITSHIFT_NONE;
    handle.Init.OversamplingMode = DISABLE;
#if defined(ADC_VER_V5_V90)
    handle.Init.SamplingMode = ADC_SAMPLING_MODE_NORMAL;
#endif
}

int32_t apply_adc_init(adc16_map_t &map,
                       const bsp_adc16_init_config_t &config,
                       uint8_t conversion_count,
                       bool hardware_trigger = false)
{
    if (!is_supported_config(config) || (conversion_count == 0U) || (conversion_count > kMaxSequenceChannels)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (hardware_trigger) {
        if (!map.has_sequence_trigger_route || !is_supported_external_trigger(map.sequence_external_trigger)) {
            return BSP_ERROR_PARAM;
        }
    }

    __HAL_RCC_ADC12_CLK_ENABLE();
    adc_gpio_init_for_default_channel(map.default_channel);

    if (map.initialized) {
        (void) HAL_ADC_Stop(&map.handle);
        (void) HAL_ADC_Stop_IT(&map.handle);
        if (map.handle.DMA_Handle != nullptr) {
            (void) HAL_ADC_Stop_DMA(&map.handle);
        }
        (void) HAL_ADCEx_InjectedStop_IT(&map.handle);
        (void) HAL_ADC_DeInit(&map.handle);
    }

    fill_init(map.handle,
              map.base,
              config,
              conversion_count,
              hardware_trigger,
              map.sequence_external_trigger,
              map.sequence_external_trigger_edge);
    if (HAL_ADC_Init(&map.handle) != HAL_OK) {
        map.initialized = false;
        return BSP_ERROR;
    }
    if (HAL_ADCEx_Calibration_Start(&map.handle, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED) != HAL_OK) {
        map.initialized = false;
        return BSP_ERROR;
    }

    map.config = config;
    map.initialized = true;
    map.sequence_dma_active = false;
    map.sequence_dma_buffer = nullptr;
    map.sequence_dma_sample_count = 0U;
    HAL_NVIC_SetPriority(map.irq, 5, 0);
    HAL_NVIC_EnableIRQ(map.irq);
    return BSP_OK;
}

int32_t ensure_initialized(bsp_adc16_instance_t adc)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }

    auto &map = s_adc16_map[adc];
    if (!map.has_pinmux) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (!adc16_has_feature(map, BSP_ADC16_FEATURE_ONESHOT)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (map.initialized) {
        return BSP_OK;
    }

    bsp_adc16_init_config_t config{};
    bsp_adc16_get_default_init_config(&config);
    const auto init_status = apply_adc_init(map, config, 1U);
    if (init_status != BSP_OK) {
        return init_status;
    }
    map.active_channel = map.default_channel;
    return configure_channel_rank(map, map.default_channel, 0U);
}

} // namespace

void bsp_adc16_get_default_init_config(bsp_adc16_init_config_t *config)
{
    if (config == nullptr) {
        return;
    }
    config->resolution = BSP_ADC16_RESOLUTION_16_BITS;
    config->clock_divider = BSP_ADC16_CLOCK_DIVIDER_4;
}

int32_t bsp_adc16_init(bsp_adc16_instance_t adc)
{
    return ensure_initialized(adc);
}

int32_t bsp_adc16_init_ex(bsp_adc16_instance_t adc, const bsp_adc16_init_config_t *config)
{
    if ((adc >= BSP_ADC16_MAX) || (config == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    auto &map = s_adc16_map[adc];
    if (!map.has_pinmux) {
        return BSP_ERROR_UNSUPPORTED;
    }
    const auto config_status = validate_adc16_config_features(map, *config);
    if (config_status != BSP_OK) {
        return config_status;
    }

    const auto init_status = apply_adc_init(map, *config, 1U);
    if (init_status != BSP_OK) {
        return init_status;
    }
    map.active_channel = map.default_channel;
    return configure_channel_rank(map, map.default_channel, 0U);
}

int32_t bsp_adc16_get_clock(bsp_adc16_instance_t adc, uint32_t *freq_hz)
{
    if ((adc >= BSP_ADC16_MAX) || (freq_hz == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    if (!adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_GET_CLOCK)) {
        return BSP_ERROR_UNSUPPORTED;
    }

    auto clock = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_ADC);
    if (clock == 0U) {
        clock = HAL_RCC_GetPCLK2Freq();
    }
    *freq_hz = clock;
    return BSP_OK;
}

int32_t bsp_adc16_read_channel(bsp_adc16_instance_t adc, uint8_t channel, uint16_t *value)
{
    if ((adc >= BSP_ADC16_MAX) || (value == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    const auto init_status = ensure_initialized(adc);
    if (init_status != BSP_OK) {
        return init_status;
    }

    auto &map = s_adc16_map[adc];
    if (!adc16_has_feature(map, BSP_ADC16_FEATURE_BLOCKING_READ)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (configure_channel_rank(map, channel, 0U) != BSP_OK) {
        return BSP_ERROR_PARAM;
    }
    map.active_channel = channel;
    map.sequence_active = false;

    if (HAL_ADC_Start(&map.handle) != HAL_OK) {
        return BSP_ERROR;
    }
    if (HAL_ADC_PollForConversion(&map.handle, HAL_MAX_DELAY) != HAL_OK) {
        (void) HAL_ADC_Stop(&map.handle);
        return BSP_ERROR_TIMEOUT;
    }
    *value = static_cast<uint16_t>(HAL_ADC_GetValue(&map.handle));
    (void) HAL_ADC_Stop(&map.handle);
    return BSP_OK;
}

int32_t bsp_adc16_read_default(bsp_adc16_instance_t adc, uint16_t *value)
{
    if ((adc >= BSP_ADC16_MAX) || (value == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    return bsp_adc16_read_channel(adc, s_adc16_map[adc].default_channel, value);
}

int32_t bsp_adc16_get_default_channel(bsp_adc16_instance_t adc, uint8_t *channel)
{
    if ((adc >= BSP_ADC16_MAX) || (channel == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    *channel = s_adc16_map[adc].default_channel;
    return BSP_OK;
}

int32_t bsp_adc16_configure_period(bsp_adc16_instance_t adc, uint8_t channel, uint8_t prescale, uint8_t period_count)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    if (!adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_PERIOD)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    (void) channel;
    (void) prescale;
    (void) period_count;
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_read_period(bsp_adc16_instance_t adc, uint8_t channel, uint16_t *value)
{
    if ((adc >= BSP_ADC16_MAX) || (value == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    if (!adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_PERIOD)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    (void) channel;
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_read_channel_async(bsp_adc16_instance_t adc, uint8_t channel)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    const auto init_status = ensure_initialized(adc);
    if (init_status != BSP_OK) {
        return init_status;
    }

    auto &map = s_adc16_map[adc];
    if (!adc16_has_feature(map, BSP_ADC16_FEATURE_INTERRUPT_READ)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (map.callback == nullptr) {
        return BSP_ERROR_PARAM;
    }
    if (configure_channel_rank(map, channel, 0U) != BSP_OK) {
        return BSP_ERROR_PARAM;
    }
    map.active_channel = channel;
    map.sequence_active = false;
    return (HAL_ADC_Start_IT(&map.handle) == HAL_OK) ? BSP_OK : BSP_ERROR_BUSY;
}

