Cloud-Lightning/Clight/bsp/port/stm32/bsp_adc16_stm32.cpp
int32_t bsp_adc16_read_default_async(bsp_adc16_instance_t adc)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    return bsp_adc16_read_channel_async(adc, s_adc16_map[adc].default_channel);
}

int32_t bsp_adc16_register_callback(bsp_adc16_instance_t adc, bsp_adc16_callback_t callback, void *arg)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    if (!adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_INTERRUPT_READ)) {
        return BSP_ERROR_UNSUPPORTED;
    }

    s_adc16_map[adc].callback = callback;
    s_adc16_map[adc].callback_arg = arg;
    return BSP_OK;
}

int32_t bsp_adc16_set_sequence_trigger_route(bsp_adc16_instance_t adc, const bsp_adc16_trigger_route_t *route)
{
    if ((adc >= BSP_ADC16_MAX) || (route == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    if (!adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_TRIGGER_ROUTE) ||
        !adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_SEQUENCE_HARDWARE_TRIGGER)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (!is_supported_external_trigger(route->input) || (route->input == ADC_SOFTWARE_START)) {
        return BSP_ERROR_PARAM;
    }

    auto &map = s_adc16_map[adc];
    map.sequence_external_trigger = route->input;
    map.sequence_external_trigger_edge = trigger_route_edge(*route);
    map.has_sequence_trigger_route = true;
    return BSP_OK;
}

int32_t bsp_adc16_configure_sequence(bsp_adc16_instance_t adc,
                                     const uint8_t *channels,
                                     uint8_t count,
                                     bsp_state_t continuous,
                                     bsp_state_t hardware_trigger)
{
    if ((adc >= BSP_ADC16_MAX) || (channels == nullptr) || (count == 0U) || (count > kMaxSequenceChannels)) {
        return BSP_ERROR_PARAM;
    }
    auto &map = s_adc16_map[adc];
    if (!map.has_pinmux) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (!adc16_has_feature(map, BSP_ADC16_FEATURE_SEQUENCE)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    const bool use_hardware_trigger = (hardware_trigger == BSP_ENABLE);
    if (use_hardware_trigger && !adc16_has_feature(map, BSP_ADC16_FEATURE_SEQUENCE_HARDWARE_TRIGGER)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (use_hardware_trigger && !map.has_sequence_trigger_route) {
        return BSP_ERROR_PARAM;
    }

    const auto config = map.initialized ? map.config : bsp_adc16_init_config_t{BSP_ADC16_RESOLUTION_16_BITS, BSP_ADC16_CLOCK_DIVIDER_4};
    const auto init_status = apply_adc_init(map, config, count, use_hardware_trigger);
    if (init_status != BSP_OK) {
        return init_status;
    }

    for (uint8_t index = 0U; index < count; ++index) {
        if (configure_channel_rank(map, channels[index], index) != BSP_OK) {
            return BSP_ERROR_PARAM;
        }
        map.sequence_channels[index] = channels[index];
    }

    map.sequence_count = count;
    map.sequence_index = 0U;
    map.sequence_continuous = (continuous == BSP_ENABLE);
    map.sequence_hardware_trigger = use_hardware_trigger;
    map.sequence_dma_active = false;
    map.preemption_active = false;
    return BSP_OK;
}

int32_t bsp_adc16_start_sequence(bsp_adc16_instance_t adc)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    auto &map = s_adc16_map[adc];
    if (!adc16_has_feature(map, BSP_ADC16_FEATURE_SEQUENCE)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (!map.initialized || (map.sequence_count == 0U) || (map.sequence_callback == nullptr)) {
        return BSP_ERROR_PARAM;
    }

    map.sequence_active = true;
    map.sequence_dma_active = false;
    map.sequence_index = 0U;
    std::memset(map.sequence_samples, 0, sizeof(map.sequence_samples));
    return (HAL_ADC_Start_IT(&map.handle) == HAL_OK) ? BSP_OK : BSP_ERROR_BUSY;
}

int32_t bsp_adc16_start_sequence_dma(bsp_adc16_instance_t adc, const bsp_adc16_dma_sequence_config_t *config)
{
    if ((adc >= BSP_ADC16_MAX) || (config == nullptr) || (config->buffer == nullptr) || (config->sample_count == 0U)) {
        return BSP_ERROR_PARAM;
    }
    auto &map = s_adc16_map[adc];
    if (!adc16_has_feature(map, BSP_ADC16_FEATURE_SEQUENCE_DMA)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if ((config->circular == BSP_ENABLE) && !adc16_has_feature(map, BSP_ADC16_FEATURE_CONTINUOUS_DMA)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (!map.initialized || (map.sequence_count == 0U) || (map.sequence_callback == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    if ((config->sample_count % map.sequence_count) != 0U) {
        return BSP_ERROR_PARAM;
    }

    const bool circular = (config->circular == BSP_ENABLE);
    if (!configure_adc1_dma(map, circular)) {
        return BSP_ERROR_UNSUPPORTED;
    }

    map.handle.Init.ConversionDataManagement = circular ? ADC_CONVERSIONDATA_DMA_CIRCULAR : ADC_CONVERSIONDATA_DMA_ONESHOT;
    if (HAL_ADC_Init(&map.handle) != HAL_OK) {
        return BSP_ERROR;
    }
    for (uint8_t index = 0U; index < map.sequence_count; ++index) {
        if (configure_channel_rank(map, map.sequence_channels[index], index) != BSP_OK) {
            return BSP_ERROR_PARAM;
        }
    }

    map.sequence_active = true;
    map.sequence_dma_active = true;
    map.sequence_dma_circular = circular;
    map.sequence_dma_buffer = config->buffer;
    map.sequence_dma_sample_count = config->sample_count;
    map.sequence_index = 0U;
    std::memset(map.sequence_samples, 0, sizeof(map.sequence_samples));
    return (HAL_ADC_Start_DMA(&map.handle, config->buffer, config->sample_count) == HAL_OK) ? BSP_OK : BSP_ERROR_BUSY;
}

int32_t bsp_adc16_register_sequence_callback(bsp_adc16_instance_t adc, bsp_adc16_sequence_callback_t callback, void *arg)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    if (!adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_SEQUENCE)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    s_adc16_map[adc].sequence_callback = callback;
    s_adc16_map[adc].sequence_callback_arg = arg;
    return BSP_OK;
}

