Cloud-Lightning/Clight/bsp/port/stm32/bsp_adc16_stm32.cpp
int32_t bsp_adc16_set_preemption_trigger_route(bsp_adc16_instance_t adc, const bsp_adc16_trigger_route_t *route)
{
    if ((adc >= BSP_ADC16_MAX) || (route == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    if (!adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_TRIGGER_ROUTE) ||
        !adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_PREEMPTION_HARDWARE_TRIGGER)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (!is_supported_injected_external_trigger(route->input) || (route->input == ADC_INJECTED_SOFTWARE_START)) {
        return BSP_ERROR_PARAM;
    }

    auto &map = s_adc16_map[adc];
    map.preemption_external_trigger = route->input;
    map.preemption_external_trigger_edge = injected_trigger_route_edge(*route);
    map.has_preemption_trigger_route = true;
    return BSP_OK;
}

int32_t bsp_adc16_configure_preemption(bsp_adc16_instance_t adc,
                                       uint8_t trigger_channel,
                                       const uint8_t *channels,
                                       uint8_t count,
                                       bsp_state_t hardware_trigger)
{
    if ((adc >= BSP_ADC16_MAX) || (channels == nullptr) || (count == 0U) || (count > kMaxInjectedChannels)) {
        return BSP_ERROR_PARAM;
    }
    auto &map = s_adc16_map[adc];
    if (!map.has_pinmux) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (!adc16_has_feature(map, BSP_ADC16_FEATURE_PREEMPTION)) {
        return BSP_ERROR_UNSUPPORTED;
    }

    const bool use_hardware_trigger = (hardware_trigger == BSP_ENABLE);
    if (use_hardware_trigger && !adc16_has_feature(map, BSP_ADC16_FEATURE_PREEMPTION_HARDWARE_TRIGGER)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (use_hardware_trigger) {
        if (!map.has_preemption_trigger_route || !is_supported_injected_external_trigger(map.preemption_external_trigger)) {
            return BSP_ERROR_PARAM;
        }
    }

    const auto config = map.initialized ? map.config : bsp_adc16_init_config_t{BSP_ADC16_RESOLUTION_16_BITS, BSP_ADC16_CLOCK_DIVIDER_4};
    const auto init_status = apply_adc_init(map, config, count, false);
    if (init_status != BSP_OK) {
        return init_status;
    }

    for (uint8_t index = 0U; index < count; ++index) {
        if (configure_injected_channel_rank(map, channels[index], index, count, use_hardware_trigger) != BSP_OK) {
            return BSP_ERROR_PARAM;
        }
        map.preemption_channels[index] = channels[index];
    }

    map.preemption_trigger_channel = trigger_channel;
    map.preemption_count = count;
    map.preemption_hardware_trigger = use_hardware_trigger;
    map.preemption_active = false;
    map.sequence_active = false;
    return BSP_OK;
}

int32_t bsp_adc16_start_preemption(bsp_adc16_instance_t adc)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    auto &map = s_adc16_map[adc];
    if (!adc16_has_feature(map, BSP_ADC16_FEATURE_PREEMPTION)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    if (!map.initialized || (map.preemption_count == 0U) || (map.preemption_callback == nullptr)) {
        return BSP_ERROR_PARAM;
    }

    map.preemption_active = true;
    std::memset(map.preemption_samples, 0, sizeof(map.preemption_samples));
    return (HAL_ADCEx_InjectedStart_IT(&map.handle) == HAL_OK) ? BSP_OK : BSP_ERROR_BUSY;
}

int32_t bsp_adc16_register_preemption_callback(bsp_adc16_instance_t adc, bsp_adc16_preemption_callback_t callback, void *arg)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    if (!adc16_has_feature(s_adc16_map[adc], BSP_ADC16_FEATURE_PREEMPTION)) {
        return BSP_ERROR_UNSUPPORTED;
    }
    s_adc16_map[adc].preemption_callback = callback;
    s_adc16_map[adc].preemption_callback_arg = arg;
    return BSP_OK;
}

extern "C" void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    for (std::uint32_t index = 0; index < BSP_ADC16_MAX; ++index) {
        auto &map = s_adc16_map[index];
        if (&map.handle != hadc) {
            continue;
        }

        if (map.sequence_dma_active) {
            if ((map.sequence_dma_buffer != nullptr) && (map.sequence_dma_sample_count > 0U)) {
                const uint32_t offset = map.sequence_dma_circular ? (map.sequence_dma_sample_count / 2U) : 0U;
                const uint32_t count = map.sequence_dma_circular ? (map.sequence_dma_sample_count - offset) : map.sequence_dma_sample_count;
                emit_sequence_dma_samples(map, map.sequence_dma_buffer + offset, count);
            }
            if (!map.sequence_dma_circular) {
                map.sequence_active = false;
                map.sequence_dma_active = false;
                (void) HAL_ADC_Stop_DMA(hadc);
            }
            break;
        }

        const auto value = static_cast<uint16_t>(HAL_ADC_GetValue(hadc));
        if (map.sequence_active) {
            const auto sample_index = map.sequence_index;
            if (sample_index < map.sequence_count) {
                map.sequence_samples[sample_index].channel = map.sequence_channels[sample_index];
                map.sequence_samples[sample_index].index = sample_index;
                map.sequence_samples[sample_index].trigger_channel = 0U;
                map.sequence_samples[sample_index].value = value;
                ++map.sequence_index;
            }
            if (map.sequence_index >= map.sequence_count) {
                if (!map.sequence_continuous) {
                    map.sequence_active = false;
                    (void) HAL_ADC_Stop_IT(hadc);
                } else {
                    map.sequence_index = 0U;
                }
                if (map.sequence_callback != nullptr) {
                    map.sequence_callback(map.sequence_samples, map.sequence_count, map.sequence_callback_arg);
                }
            }
        } else if (map.callback != nullptr) {
            (void) HAL_ADC_Stop_IT(hadc);
            map.callback(map.active_channel, value, map.callback_arg);
        }
        break;
    }
}

extern "C" void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef *hadc)
{
    for (std::uint32_t index = 0; index < BSP_ADC16_MAX; ++index) {
        auto &map = s_adc16_map[index];
        if (&map.handle != hadc) {
            continue;
        }
        if (map.sequence_dma_active && map.sequence_dma_circular && (map.sequence_dma_buffer != nullptr)) {
            emit_sequence_dma_samples(map, map.sequence_dma_buffer, map.sequence_dma_sample_count / 2U);
        }
        break;
    }
}

extern "C" void HAL_ADCEx_InjectedConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    for (std::uint32_t index = 0; index < BSP_ADC16_MAX; ++index) {
        auto &map = s_adc16_map[index];
        if (&map.handle != hadc) {
            continue;
        }

        if (map.preemption_active && (map.preemption_count > 0U)) {
            for (uint8_t sample_index = 0U; sample_index < map.preemption_count; ++sample_index) {
                map.preemption_samples[sample_index].channel = map.preemption_channels[sample_index];
                map.preemption_samples[sample_index].index = sample_index;
                map.preemption_samples[sample_index].trigger_channel = map.preemption_trigger_channel;
                map.preemption_samples[sample_index].value =
                    static_cast<uint16_t>(HAL_ADCEx_InjectedGetValue(hadc, injected_rank_to_hal(sample_index)));
            }
            if (!map.preemption_hardware_trigger) {
                map.preemption_active = false;
                (void) HAL_ADCEx_InjectedStop_IT(hadc);
            }
            if (map.preemption_callback != nullptr) {
                map.preemption_callback(map.preemption_trigger_channel,
                                        map.preemption_samples,
                                        map.preemption_count,
                                        map.preemption_callback_arg);
            }
        }
        break;
    }
}

extern "C" void DMA1_Stream5_IRQHandler(void)
{
    if (s_adc1_dma_configured) {
        HAL_DMA_IRQHandler(&s_adc1_dma);
    }
}

extern "C" void bsp_stm32_adc_irq_handler(void)
{
    if (s_adc16_map[BSP_ADC16_MAIN].initialized) {
        HAL_ADC_IRQHandler(&s_adc16_map[BSP_ADC16_MAIN].handle);
    }
}

extern "C" void ADC_IRQHandler(void)
{
    bsp_stm32_adc_irq_handler();
}

#else

void bsp_adc16_get_default_init_config(bsp_adc16_init_config_t *config)
{
    if (config == nullptr) {
        return;
    }
    config->resolution = BSP_ADC16_RESOLUTION_16_BITS;
    config->clock_divider = BSP_ADC16_CLOCK_DIVIDER_4;
}

int32_t bsp_adc16_init(bsp_adc16_instance_t adc)
{
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_init_ex(bsp_adc16_instance_t adc, const bsp_adc16_init_config_t *config)
{
    if ((adc >= BSP_ADC16_MAX) || (config == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_get_clock(bsp_adc16_instance_t adc, uint32_t *freq_hz)
{
    if ((adc >= BSP_ADC16_MAX) || (freq_hz == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    *freq_hz = 0U;
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_read_channel(bsp_adc16_instance_t adc, uint8_t channel, uint16_t *value)
{
    (void) channel;
    if ((adc >= BSP_ADC16_MAX) || (value == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    *value = 0U;
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_read_default(bsp_adc16_instance_t adc, uint16_t *value)
{
    if ((adc >= BSP_ADC16_MAX) || (value == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    *value = 0U;
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_get_default_channel(bsp_adc16_instance_t adc, uint8_t *channel)
{
    if ((adc >= BSP_ADC16_MAX) || (channel == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    *channel = 0U;
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_configure_period(bsp_adc16_instance_t adc, uint8_t channel, uint8_t prescale, uint8_t period_count)
{
    (void) channel;
    (void) prescale;
    (void) period_count;
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_read_period(bsp_adc16_instance_t adc, uint8_t channel, uint16_t *value)
{
    (void) channel;
    if ((adc >= BSP_ADC16_MAX) || (value == nullptr)) {
        return BSP_ERROR_PARAM;
    }
    *value = 0U;
    return BSP_ERROR_UNSUPPORTED;
}

int32_t bsp_adc16_read_channel_async(bsp_adc16_instance_t adc, uint8_t channel)
{
    (void) channel;
    if (adc >= BSP_ADC16_MAX) {
        return BSP_ERROR_PARAM;
    }
    return BSP_ERROR_UNSUPPORTED;
}

